pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:           LPC1100PinCfg.h
** Last modified Date:  2009-10-22
** Last Version:        V1.01
** Descriptions:        LPC1300系列CPU引脚连接与模式配置
**
**--------------------------------------------------------------------------------------------------------
** Created by:          Lanwuqiang
** Created date:        2009-10-22
** Version:             V1.00
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Modified by:         ZhangNingbo
** Modified date:       2010-03-02
** Version:             V1.01
** Descriptions:        
*********************************************************************************************************/
#ifndef __LPC1100PINCFG_H
#define __LPC1100PINCFG_H

/*********************************************************************************************************
  IO口引脚功能设置宏定义
*********************************************************************************************************/

/*********************************************************************************************************
  P0_0口引脚功能配置
*********************************************************************************************************/
#define PIO0_0_RESET        0x00                                        /*  复位                        */
#define PIO0_0_GPIO         0x01                                        /*  GPIO                        */

#define FUNC_PIO0_0         PIO0_0_RESET

#define PIO0_0_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_0_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_0_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_0_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_0_MODE         PIO0_0_PULLUP

#define PIO0_0_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_0_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_0_HYS          PIO0_0_HYSDISABLE

#define PIO0_0_CON         (FUNC_PIO0_0 | (PIO0_0_MODE << 3) | (PIO0_0_HYS << 5))
/*********************************************************************************************************
  P0_1口引脚功能配置
*********************************************************************************************************/
#define PIO0_1_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_1_CLKOUT       0x01                                        /*  时钟输出                    */
#define PIO0_1_CT32B0_MAT2  0x02                                        /*  32位定时器0匹配输出，通道2  */

#define FUNC_PIO0_1         PIO0_1_GPIO

#define PIO0_1_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_1_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_1_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_1_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_1_MODE         PIO0_1_PULLUP

#define PIO0_1_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_1_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_1_HYS          PIO0_1_HYSDISABLE

#define PIO0_1_CON         (FUNC_PIO0_1 | (PIO0_1_MODE << 3) | (PIO0_1_HYS << 5))
/*********************************************************************************************************
  P0_2口引脚功能配置
*********************************************************************************************************/
#define PIO0_2_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_2_SSEL0        0x01                                        /*  SSP总线从机选择             */
#define PIO0_2_CT16B0_CAP0  0x02                                        /*  16位定时器0捕获输入，通道0  */

#define FUNC_PIO0_2         PIO0_2_GPIO

#define PIO0_2_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_2_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_2_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_2_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_2_MODE         PIO0_2_PULLUP

#define PIO0_2_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_2_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_2_HYS          PIO0_2_HYSDISABLE

#define PIO0_2_CON         (FUNC_PIO0_2 | (PIO0_2_MODE << 3) | (PIO0_2_HYS << 5))
/*********************************************************************************************************
  P0_3口引脚功能配置
*********************************************************************************************************/
#define PIO0_3_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO0_3         PIO0_3_GPIO

#define PIO0_3_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_3_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_3_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_3_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_3_MODE         PIO0_3_PULLUP

#define PIO0_3_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_3_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_3_HYS          PIO0_3_HYSDISABLE

#define PIO0_3_CON         (FUNC_PIO0_3 | (PIO0_3_MODE << 3) | (PIO0_3_HYS << 5))
/*********************************************************************************************************
  P0_4口引脚功能配置
*********************************************************************************************************/
#define PIO0_4_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_4_SCL          0x01                                        /*  I2C时钟线（开漏）           */

#define FUNC_PIO0_4         PIO0_4_GPIO

#define PIO0_4_STD_I2C      0x00                                        /*  标准/快速I2C模式            */
#define PIO0_4_STD_IO       0x01                                        /*  标准IO模式                  */
#define PIO0_4_FM_I2C       0x02                                        /*  快速I2C模式                 */

