pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define PIO0_4_MODE         PIO0_4_STD_I2C

#define PIO0_4_CON         (FUNC_PIO0_4 | (PIO0_4_MODE << 8))
/*********************************************************************************************************
  P0_5口引脚功能配置
*********************************************************************************************************/
#define PIO0_5_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_5_SDA          0x01                                        /*  I2C数据线（开漏）           */

#define FUNC_PIO0_5         PIO0_5_GPIO

#define PIO0_5_STD_I2C      0x00                                        /*  标准/快速I2C模式            */
#define PIO0_5_STD_IO       0x01                                        /*  标准IO模式                  */
#define PIO0_5_FM_I2C       0x02                                        /*  快速I2C模式                 */

#define PIO0_5_MODE         PIO0_5_STD_I2C

#define PIO0_5_CON         (FUNC_PIO0_5 | (PIO0_5_MODE << 8))
/*********************************************************************************************************
  P0_6口引脚功能配置
*********************************************************************************************************/
#define PIO0_6_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_6_SCK0         0x02                                        /*  SSP时钟线                   */

#define FUNC_PIO0_6         PIO0_6_GPIO

#define PIO0_6_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_6_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_6_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_6_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_6_MODE         PIO0_6_PULLUP

#define PIO0_6_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_6_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_6_HYS          PIO0_6_HYSDISABLE

#define PIO0_6_CON         (FUNC_PIO0_6 | (PIO0_6_MODE << 3) | (PIO0_6_HYS << 5))
/*********************************************************************************************************
  P0_7口引脚功能配置
*********************************************************************************************************/
#define PIO0_7_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_7_CTS          0x01                                        /*  UART清零发送信号CTS         */

#define FUNC_PIO0_7         PIO0_7_GPIO

#define PIO0_7_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_7_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_7_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_7_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_7_MODE         PIO0_7_PULLUP

#define PIO0_7_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_7_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_7_HYS          PIO0_7_HYSDISABLE

#define PIO0_7_CON         (FUNC_PIO0_7 | (PIO0_7_MODE << 3) | (PIO0_7_HYS << 5))
/*********************************************************************************************************
  P0_8口引脚功能配置
*********************************************************************************************************/
#define PIO0_8_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_8_MISO0        0x01                                        /*  SSP主输入从输出数据线       */
#define PIO0_8_CT16B0_MAT0  0x02                                        /*  16位定时器0匹配输出，通道0  */

#define FUNC_PIO0_8         PIO0_8_GPIO

#define PIO0_8_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_8_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_8_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_8_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_8_MODE         PIO0_8_PULLUP

#define PIO0_8_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_8_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_8_HYS          PIO0_8_HYSDISABLE

#define PIO0_8_CON         (FUNC_PIO0_8 | (PIO0_8_MODE << 3) | (PIO0_8_HYS << 5))
/*********************************************************************************************************
  P0_9口引脚功能配置
*********************************************************************************************************/
#define PIO0_9_GPIO         0x00                                        /*  GPIO                        */
#define PIO0_9_MOSI0        0x01                                        /*  SSP主输出从输入数据线       */
#define PIO0_9_CT16B0_MAT1  0x02                                        /*  16位定时器0匹配输出，通道1  */

#define FUNC_PIO0_9         PIO0_9_GPIO

#define PIO0_9_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_9_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO0_9_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO0_9_REPEATER     0x03                                        /*  中继模式                    */

#define PIO0_9_MODE         PIO0_9_PULLUP

#define PIO0_9_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO0_9_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO0_9_HYS          PIO0_9_HYSDISABLE

