pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define PIO0_9_CON         (FUNC_PIO0_9 | (PIO0_9_MODE << 3) | (PIO0_9_HYS << 5))
/*********************************************************************************************************
  P0_10口引脚功能配置
*********************************************************************************************************/
#define PIO0_10_SWCLK       0x00                                        /*  串行调试时钟线              */
#define PIO0_10_GPIO        0x01                                        /*  GPIO                        */
#define PIO0_10_SCK0        0x02                                        /*  SSP时钟线                   */
#define PIO0_10_CT16B0_MAT2 0x03                                        /*  16位定时器0匹配输出，通道2  */

#define FUNC_PIO0_10        PIO0_10_SWCLK

#define PIO0_10_INACTIVE    0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_10_PULLDOWN    0x01                                        /*  内部下拉                    */
#define PIO0_10_PULLUP      0x02                                        /*  内部上拉                    */
#define PIO0_10_REPEATER    0x03                                        /*  中继模式                    */

#define PIO0_10_MODE        PIO0_10_PULLUP

#define PIO0_10_HYSDISABLE  0                                           /*  滞后禁能                    */
#define PIO0_10_HYSENABLE   1                                           /*  滞后使能                    */

#define PIO0_10_HYS         PIO0_10_HYSDISABLE

#define PIO0_10_CON        (FUNC_PIO0_10 | (PIO0_10_MODE << 3) | (PIO0_10_HYS << 5))
/*********************************************************************************************************
  P0_11口引脚功能配置
*********************************************************************************************************/
#define PIO0_11_TDI         0x00                                        /*  JTAG数据输入                */
#define PIO0_11_GPIO        0x01                                        /*  GPIO                        */
#define PIO0_11_AD0         0x02                                        /*  AD转换通道0                 */
#define PIO0_11_CT32B0_MAT3 0x03                                        /*  32位定时器0匹配输出，通道3  */

#define FUNC_PIO0_11        PIO0_11_TDI

#define PIO0_11_INACTIVE    0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO0_11_PULLDOWN    0x01                                        /*  内部下拉                    */
#define PIO0_11_PULLUP      0x02                                        /*  内部上拉                    */
#define PIO0_11_REPEATER    0x03                                        /*  中继模式                    */

#define PIO0_11_MODE        PIO0_11_PULLUP

#define PIO0_11_HYSDISABLE  0                                           /*  滞后禁能                    */
#define PIO0_11_HYSENABLE   1                                           /*  滞后使能                    */

#define PIO0_11_HYS         PIO0_11_HYSDISABLE

#define PIO0_11_ANALOG      0                                           /*  模拟输入模式                */
#define PIO0_11_DIGITAL     1                                           /*  数字模式                    */

#define PIO0_11_ADMODE      PIO0_11_DIGITAL

#define PIO0_11_CON        (FUNC_PIO0_11 | (PIO0_11_MODE << 3) | \
                           (PIO0_11_HYS << 5) | (PIO0_11_ADMODE << 7))
/*********************************************************************************************************
  P1_0口引脚功能配置
*********************************************************************************************************/
#define PIO1_0_TMS          0x00                                        /*  JTAG模式选择                */
#define PIO1_0_GPIO         0x01                                        /*  GPIO                        */
#define PIO1_0_AD1          0x02                                        /*  AD转换通道1                 */
#define PIO1_0_CT32B1_CAP0  0x03                                        /*  32位定时器1捕获输入，通道0  */

#define FUNC_PIO1_0         PIO1_0_TMS

#define PIO1_0_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_0_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_0_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_0_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_0_MODE         PIO1_0_PULLUP

#define PIO1_0_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_0_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_0_HYS          PIO1_0_HYSDISABLE
 
#define PIO1_0_ANALOG       0                                           /*  模拟输入模式                */
#define PIO1_0_DIGITAL      1                                           /*  数字模式                    */

#define PIO1_0_ADMODE       PIO1_0_DIGITAL

#define PIO1_0_CON         (FUNC_PIO1_0 | (PIO1_0_MODE << 3) | \
                           (PIO1_0_HYS << 5) | (PIO1_0_ADMODE << 7))
/*********************************************************************************************************
  P1_1口引脚功能配置
*********************************************************************************************************/
#define PIO1_1_TDO          0x00                                        /*  JTAG数据输出                */
#define PIO1_1_GPIO         0x01                                        /*  GPIO                        */
#define PIO1_1_AD2          0x02                                        /*  AD转换通道2                 */
#define PIO1_1_CT32B1_MAT0  0x03                                        /*  32位定时器1匹配输出，通道0  */

#define FUNC_PIO1_1         PIO1_1_TDO

#define PIO1_1_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_1_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_1_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_1_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_1_MODE         PIO1_1_PULLUP

#define PIO1_1_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_1_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_1_HYS          PIO1_1_HYSDISABLE

#define PIO1_1_ANALOG       0                                           /*  模拟输入模式                */
#define PIO1_1_DIGITAL      1                                           /*  数字模式                    */

#define PIO1_1_ADMODE       PIO1_1_DIGITAL

#define PIO1_1_CON         (FUNC_PIO1_1 | (PIO1_1_MODE << 3) | \
                           (PIO1_1_HYS << 5) | (PIO1_1_ADMODE << 7))
/*********************************************************************************************************
  P1_2口引脚功能配置
*********************************************************************************************************/
#define PIO1_2_TRST         0x00                                        /*  JTAG复位                    */
#define PIO1_2_GPIO         0x01                                        /*  GPIO                        */
#define PIO1_2_AD3          0x02                                        /*  AD转换通道3                 */
#define PIO1_2_CT32B1_MAT1  0x03                                        /*  32位定时器1匹配输出，通道1  */

