pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define FUNC_PIO1_2         PIO1_2_TRST

#define PIO1_2_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_2_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_2_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_2_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_2_MODE         PIO1_2_PULLUP

#define PIO1_2_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_2_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_2_HYS          PIO1_2_HYSDISABLE

#define PIO1_2_ANALOG       0                                           /*  模拟输入模式                */
#define PIO1_2_DIGITAL      1                                           /*  数字模式                    */

#define PIO1_2_ADMODE       PIO1_2_DIGITAL

#define PIO1_2_CON         (FUNC_PIO1_2 | (PIO1_2_MODE << 3) | \
                           (PIO1_2_HYS << 5) | (PIO1_2_ADMODE << 7))
/*********************************************************************************************************
  P1_3口引脚功能配置
*********************************************************************************************************/
#define PIO1_3_SWDIO        0x00                                        /*  串行调试数据输入输出        */
#define PIO1_3_GPIO         0x01                                        /*  GPIO                        */
#define PIO1_3_AD4          0x02                                        /*  AD转换通道4                 */
#define PIO1_3_CT32B1_MAT2  0x03                                        /*  32位定时器1匹配输出，通道2  */

#define FUNC_PIO1_3         PIO1_3_SWDIO

#define PIO1_3_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_3_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_3_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_3_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_3_MODE         PIO1_3_PULLUP

#define PIO1_3_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_3_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_3_HYS          PIO1_3_HYSDISABLE

#define PIO1_3_ANALOG       0                                           /*  模拟输入模式                */
#define PIO1_3_DIGITAL      1                                           /*  数字模式                    */

#define PIO1_3_ADMODE       PIO1_3_DIGITAL

#define PIO1_3_CON         (FUNC_PIO1_3 | (PIO1_3_MODE << 3) | \
                           (PIO1_3_HYS << 5) | (PIO1_3_ADMODE << 7))
/*********************************************************************************************************
  P1_4口引脚功能配置
*********************************************************************************************************/
#define PIO1_4_GPIO         0x00                                        /*  GPIO                        */
#define PIO1_4_AD5          0x01                                        /*  AD转换通道5                 */
#define PIO1_4_CT32B1_MAT3  0x02                                        /*  32位定时器1匹配输出，通道3  */

#define FUNC_PIO1_4         PIO1_4_GPIO

#define PIO1_4_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_4_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_4_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_4_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_4_MODE         PIO1_4_PULLUP

#define PIO1_4_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_4_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_4_HYS          PIO1_4_HYSDISABLE

#define PIO1_4_ANALOG       0                                           /*  模拟输入模式                */
#define PIO1_4_DIGITAL      1                                           /*  数字模式                    */

#define PIO1_4_ADMODE       PIO1_4_DIGITAL

#define PIO1_4_CON         (FUNC_PIO1_4 | (PIO1_4_MODE << 3) | \
                           (PIO1_4_HYS << 5) | (PIO1_4_ADMODE << 7))
/*********************************************************************************************************
  P1_5口引脚功能配置
*********************************************************************************************************/
#define PIO1_5_GPIO         0x00                                        /*  GPIO                        */
#define PIO1_5_RTS          0x01                                        /*  UART请求发送引脚            */
#define PIO1_5_CT32B0_CAP0  0x02                                        /*  32位定时器0捕获输入，通道0  */

#define FUNC_PIO1_5         PIO1_5_GPIO

#define PIO1_5_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_5_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_5_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_5_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_5_MODE         PIO1_5_PULLUP

#define PIO1_5_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_5_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_5_HYS          PIO1_5_HYSDISABLE

#define PIO1_5_CON         (FUNC_PIO1_5 | (PIO1_5_MODE << 3) | (PIO1_5_HYS << 5))
/*********************************************************************************************************
  P1_6口引脚功能配置
*********************************************************************************************************/
#define PIO1_6_GPIO         0x00                                        /*  GPIO                        */
#define PIO1_6_UART_RXD     0x01                                        /*  UART数据接收引脚            */
#define PIO1_6_CT32B0_MAT0  0x02                                        /*  32位定时器0匹配输出，通道0  */

#define FUNC_PIO1_6         PIO1_6_GPIO

#define PIO1_6_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_6_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_6_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_6_REPEATER     0x03                                        /*  中继模式                    */

