pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define PIO1_6_MODE         PIO1_6_PULLUP

#define PIO1_6_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_6_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_6_HYS          PIO1_6_HYSDISABLE

#define PIO1_6_CON         (FUNC_PIO1_6 | (PIO1_6_MODE << 3) | (PIO1_6_HYS << 5))
/*********************************************************************************************************
  P1_7口引脚功能配置
*********************************************************************************************************/
#define PIO1_7_GPIO         0x00                                        /*  GPIO                        */
#define PIO1_7_UART_TXD     0x01                                        /*  UART数据发送引脚            */
#define PIO1_7_CT32B0_MAT1  0x02                                        /*  32位定时器0匹配输出，通道1  */

#define FUNC_PIO1_7         PIO1_7_GPIO
 
#define PIO1_7_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_7_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_7_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_7_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_7_MODE         PIO1_7_PULLUP

#define PIO1_7_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_7_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_7_HYS          PIO1_7_HYSDISABLE

#define PIO1_7_CON         (FUNC_PIO1_7 | (PIO1_7_MODE << 3) | (PIO1_7_HYS << 5))
/*********************************************************************************************************
  P1_8口引脚功能配置
*********************************************************************************************************/
#define PIO1_8_GPIO         0x00                                        /*  GPIO                        */
#define PIO1_8_CT16B1_CAP0  0x01                                        /*  16位定时器1捕获输入，通道0  */

#define FUNC_PIO1_8         PIO1_8_GPIO

#define PIO1_8_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_8_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_8_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_8_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_8_MODE         PIO1_8_PULLUP

#define PIO1_8_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_8_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_8_HYS          PIO1_8_HYSDISABLE

#define PIO1_8_CON         (FUNC_PIO1_8 | (PIO1_8_MODE << 3) | (PIO1_8_HYS << 5))
/*********************************************************************************************************
  P1_9口引脚功能配置
*********************************************************************************************************/
#define PIO1_9_GPIO         0x00                                        /*  GPIO                        */
#define PIO1_9_CT16B1_MAT0  0x01                                        /*  16位定时器1匹配输出，通道0  */

#define FUNC_PIO1_9         PIO1_9_GPIO

#define PIO1_9_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_9_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO1_9_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO1_9_REPEATER     0x03                                        /*  中继模式                    */

#define PIO1_9_MODE         PIO1_9_PULLUP

#define PIO1_9_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO1_9_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO1_9_HYS          PIO1_9_HYSDISABLE

#define PIO1_9_CON          (FUNC_PIO1_9 | (PIO1_9_MODE << 3) | (PIO1_9_HYS << 5))
/*********************************************************************************************************
  P1_10口引脚功能配置
*********************************************************************************************************/
#define PIO1_10_GPIO        0x00                                        /*  GPIO                        */
#define PIO1_10_AD6         0x01                                        /*  AD转换通道6                 */
#define PIO1_10_CT16B1_MAT1 0x02                                        /*  16位定时器1匹配输出，通道1  */

#define FUNC_PIO1_10        PIO1_10_GPIO

#define PIO1_10_INACTIVE    0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_10_PULLDOWN    0x01                                        /*  内部下拉                    */
#define PIO1_10_PULLUP      0x02                                        /*  内部上拉                    */
#define PIO1_10_REPEATER    0x03                                        /*  中继模式                    */

#define PIO1_10_MODE        PIO1_10_PULLUP

#define PIO1_10_HYSDISABLE  0                                           /*  滞后禁能                    */
#define PIO1_10_HYSENABLE   1                                           /*  滞后使能                    */

#define PIO1_10_HYS         PIO1_10_HYSDISABLE

#define PIO1_10_ANALOG      0                                           /*  模拟输入模式                */
#define PIO1_10_DIGITAL     1                                           /*  数字模式                    */

#define PIO1_10_ADMODE      PIO1_10_DIGITAL

#define PIO1_10_CON         (FUNC_PIO1_10 | (PIO1_10_MODE << 3) | \
                            (PIO1_10_HYS << 5) | (PIO1_10_ADMODE << 7))
/*********************************************************************************************************
  P1_11口引脚功能配置
*********************************************************************************************************/
#define PIO1_11_GPIO        0x00                                        /*  GPIO                        */
#define PIO1_11_AD7         0x01                                        /*  AD转换通道7                 */

#define FUNC_PIO1_11        PIO1_11_GPIO

#define PIO1_11_INACTIVE    0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO1_11_PULLDOWN    0x01                                        /*  内部下拉                    */
#define PIO1_11_PULLUP      0x02                                        /*  内部上拉                    */
#define PIO1_11_REPEATER    0x03                                        /*  中继模式                    */

#define PIO1_11_MODE        PIO1_0_PULLUP

