pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define PIO1_11_HYSDISABLE  0                                           /*  滞后禁能                    */
#define PIO1_11_HYSENABLE   1                                           /*  滞后使能                    */

#define PIO1_11_HYS         PIO1_11_HYSDISABLE

#define PIO1_11_ANALOG      0                                           /*  模拟输入模式                */
#define PIO1_11_DIGITAL     1                                           /*  数字模式                    */

#define PIO1_11_ADMODE      PIO1_11_DIGITAL

#define PIO1_11_CON        (FUNC_PIO1_11 | (PIO1_11_MODE << 3) | \
                           (PIO1_11_HYS << 5) | (PIO1_11_ADMODE << 7))
/*********************************************************************************************************
  P2_0口引脚功能配置
*********************************************************************************************************/
#define PIO2_0_GPIO         0x00                                        /*  GPIO                        */
#define PIO2_0_DTR          0x01                                        /*  UART终端就绪DTR             */
#define PIO2_0_SSEL1        0x02                                        /*  SSP总线从机选择             */

#define FUNC_PIO2_0         PIO2_0_GPIO

#define PIO2_0_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_0_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_0_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_0_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_0_MODE         PIO2_0_PULLUP

#define PIO2_0_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_0_HYSENABLE    1                                           /*  滞后使能                    */
 
#define PIO2_0_HYS          PIO2_0_HYSDISABLE

#define PIO2_0_CON         (FUNC_PIO2_0 | (PIO2_0_MODE << 3) | (PIO2_0_HYS << 5))
/*********************************************************************************************************
  P2_1口引脚功能配置
  注意： 仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_1_GPIO         0x00                                        /*  GPIO                        */
#define PIO2_1_DSR          0x01                                        /*  UART数据设置就绪DSR         */
#define PIO2_1_SCK1         0x02                                        /*  SSP总线时钟线               */

#define FUNC_PIO2_1         PIO2_1_GPIO

#define PIO2_1_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_1_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_1_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_1_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_1_MODE         PIO2_1_PULLUP

#define PIO2_1_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_1_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_1_HYS          PIO2_1_HYSDISABLE

#define PIO2_1_CON         (FUNC_PIO2_1 | (PIO2_1_MODE << 3) | (PIO2_1_HYS << 5))
/*********************************************************************************************************
  P2_2口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_2_GPIO         0x00                                        /*  GPIO                        */
#define PIO2_2_DCD          0x01                                        /*  UART数据载波检测输入DCD     */
#define PIO2_2_MISO1        0x02                                        /*  SSP主输入从输出数据线       */

#define FUNC_PIO2_2         PIO2_2_GPIO

#define PIO2_2_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_2_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_2_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_2_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_2_MODE         PIO2_2_PULLUP

#define PIO2_2_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_2_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_2_HYS          PIO2_2_HYSDISABLE

#define PIO2_2_CON         (FUNC_PIO2_2 | (PIO2_2_MODE << 3) | (PIO2_2_HYS << 5))
/*********************************************************************************************************
  P2_3口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_3_GPIO         0x00                                        /*  GPIO                        */
#define PIO2_3_RI           0x01                                        /*  UART振铃信号RI              */
#define PIO2_3_MOSI1        0x02                                        /*  SSP主输出从输入数据线       */

#define FUNC_PIO2_3         PIO2_3_GPIO

#define PIO2_3_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_3_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_3_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_3_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_3_MODE         PIO2_3_PULLUP

#define PIO2_3_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_3_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_3_HYS          PIO2_3_HYSDISABLE

#define PIO2_3_CON         (FUNC_PIO2_3 | (PIO2_3_MODE << 3) | (PIO2_3_HYS << 5))
/*********************************************************************************************************
  P2_4口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_4_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO2_4         PIO2_4_GPIO

#define PIO2_4_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_4_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_4_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_4_REPEATER     0x03                                        /*  中继模式                    */

