pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define PIO2_4_MODE         PIO2_4_PULLUP

#define PIO2_4_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_4_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_4_HYS          PIO2_4_HYSDISABLE

#define PIO2_4_CON         (FUNC_PIO2_4 | (PIO2_4_MODE << 3) | (PIO2_4_HYS << 5))
/*********************************************************************************************************
  P2_5口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_5_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO2_5         PIO2_5_GPIO

#define PIO2_5_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_5_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_5_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_5_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_5_MODE         PIO2_5_PULLUP

#define PIO2_5_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_5_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_5_HYS          PIO2_5_HYSDISABLE

#define PIO2_5_CON         (FUNC_PIO2_5 | (PIO2_5_MODE << 3) | (PIO2_5_HYS << 5))
/*********************************************************************************************************
  P2_6口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_6_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO2_6         PIO2_6_GPIO

#define PIO2_6_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_6_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_6_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_6_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_6_MODE         PIO2_6_PULLUP

#define PIO2_6_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_6_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_6_HYS          PIO2_6_HYSDISABLE

#define PIO2_6_CON         (FUNC_PIO2_6 | (PIO2_6_MODE << 3) | (PIO2_6_HYS << 5))
/*********************************************************************************************************
  P2_7口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_7_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO2_7         PIO2_7_GPIO

#define PIO2_7_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_7_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_7_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_7_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_7_MODE         PIO2_7_PULLUP

#define PIO2_7_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_7_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_7_HYS          PIO2_7_HYSDISABLE

#define PIO2_7_CON         (FUNC_PIO2_7 | (PIO2_7_MODE << 3) | (PIO2_7_HYS << 5))
/*********************************************************************************************************
  P2_8口引脚功能配置
  仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_8_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO2_8         PIO2_8_GPIO

#define PIO2_8_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_8_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_8_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_8_REPEATER     0x03                                        /*  中继模式                    */

#define PIO2_8_MODE         PIO2_8_PULLUP

#define PIO2_8_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_8_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_8_HYS          PIO2_8_HYSDISABLE

#define PIO2_8_CON         (FUNC_PIO2_8 | (PIO2_8_MODE << 3) | (PIO2_8_HYS << 5))
/*********************************************************************************************************
  P2_9口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_9_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO2_9         PIO2_9_GPIO

#define PIO2_9_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_9_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO2_9_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO2_9_REPEATER     0x03                                        /*  中继模式                    */

