pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define PIO2_9_MODE         PIO2_9_PULLUP

#define PIO2_9_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO2_9_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO2_9_HYS          PIO2_9_HYSDISABLE

#define PIO2_9_CON         (FUNC_PIO2_9 | (PIO2_9_MODE << 3) | (PIO2_9_HYS << 5))
/*********************************************************************************************************
  P2_10口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_10_GPIO        0x00                                        /*  GPIO                        */

#define FUNC_PIO2_10        PIO2_10_GPIO

#define PIO2_10_INACTIVE    0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO2_10_PULLDOWN    0x01                                        /*  内部下拉                    */
#define PIO2_10_PULLUP      0x02                                        /*  内部上拉                    */
#define PIO2_10_REPEATER    0x03                                        /*  中继模式                    */

#define PIO2_10_MODE        PIO2_10_PULLUP

#define PIO2_10_HYSDISABLE  0                                           /*  滞后禁能                    */
#define PIO2_10_HYSENABLE   1                                           /*  滞后使能                    */

#define PIO2_10_HYS         PIO2_10_HYSDISABLE

#define PIO2_10_CON        (FUNC_PIO2_10 | (PIO2_10_MODE << 3) | (PIO2_10_HYS << 5))
/*********************************************************************************************************
  P2_11口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装和PLCC44封装具有此引脚
*********************************************************************************************************/
#define PIO2_11_GPIO        0x00                                        /*  GPIO                       */
#define PIO2_11_SCK0        0x01                                        /*  SSP的SCK引脚               */

#define FUNC_PIO2_11        PIO2_11_GPIO

#define PIO2_11_INACTIVE    0x00                                        /*  高阻（既不上拉也不下拉）   */
#define PIO2_11_PULLDOWN    0x01                                        /*  内部下拉                   */
#define PIO2_11_PULLUP      0x02                                        /*  内部上拉                   */
#define PIO2_11_REPEATER    0x03                                        /*  中继模式                   */

#define PIO2_11_MODE        PIO2_11_PULLUP

#define PIO2_11_HYSDISABLE  0                                           /*  滞后禁能                   */
#define PIO2_11_HYSENABLE   1                                           /*  滞后使能                   */

#define PIO2_11_HYS         PIO2_11_HYSDISABLE

#define PIO2_11_CON        (FUNC_PIO2_11 | (PIO2_11_MODE << 3) | (PIO2_11_HYS << 5))
/*********************************************************************************************************
  P3_0口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装具有此引脚
*********************************************************************************************************/
#define PIO3_0_GPIO         0x00                                        /*  GPIO                        */
#define PIO3_0_DTR          0x01                                        /*  UART终端就绪DTR             */

#define FUNC_PIO3_0         PIO3_0_GPIO

#define PIO3_0_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO3_0_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO3_0_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO3_0_REPEATER     0x03                                        /*  中继模式                    */
 
#define PIO3_0_MODE         PIO3_0_PULLUP

#define PIO3_0_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO3_0_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO3_0_HYS          PIO3_0_HYSDISABLE

#define PIO3_0_CON         (FUNC_PIO3_0 | (PIO3_0_MODE << 3) | (PIO3_0_HYS << 5))
/*********************************************************************************************************
  P3_1口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装具有此引脚
*********************************************************************************************************/
#define PIO3_1_GPIO         0x00                                        /*  GPIO                        */
#define PIO3_1_DSR          0x01                                        /*  UART数据设置就绪DSR         */

#define FUNC_PIO3_1         PIO3_1_GPIO

#define PIO3_1_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO3_1_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO3_1_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO3_1_REPEATER     0x03                                        /*  中继模式                    */

#define PIO3_1_MODE         PIO3_1_PULLUP

#define PIO3_1_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO3_1_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO3_1_HYS          PIO3_1_HYSDISABLE

#define PIO3_1_CON         (FUNC_PIO3_1 | (PIO3_1_MODE << 3) | (PIO3_1_HYS << 5))
/*********************************************************************************************************
  P3_2口引脚功能配置
  注意：仅LPC1111;LPC1112;LPC1113;LPC1114的HVQFN33封装和LQFP48封装具有此引脚
*********************************************************************************************************/
#define PIO3_2_GPIO         0x00                                        /*  GPIO                        */
#define PIO3_2_DCD          0x01                                        /*  UART数据载波检测输入DCD     */

