pangfudong/i.mx53/mcu/cfg_file/Startup/LPC1100PinCfg.h
#define FUNC_PIO3_2         PIO3_2_GPIO

#define PIO3_2_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO3_2_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO3_2_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO3_2_REPEATER     0x03                                        /*  中继模式                    */

#define PIO3_2_MODE         PIO3_2_PULLUP

#define PIO3_2_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO3_2_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO3_2_HYS          PIO3_2_HYSDISABLE

#define PIO3_2_CON         (FUNC_PIO3_2 | (PIO3_2_MODE << 3) | (PIO3_2_HYS << 5))
/*********************************************************************************************************
  P3_3口引脚功能配置
  注意：仅LPC1113的LQFP48封装;LPC1114的LQFP48封装具有此引脚
*********************************************************************************************************/
#define PIO3_3_GPIO         0x00                                        /*  GPIO                        */
#define PIO3_3_RI           0x01                                        /*  UART振铃信号RI              */

#define FUNC_PIO3_3         PIO3_3_GPIO

#define PIO3_3_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO3_3_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO3_3_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO3_3_REPEATER     0x03                                        /*  中继模式                    */

#define PIO3_3_MODE         PIO3_3_PULLUP

#define PIO3_3_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO3_3_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO3_3_HYS          PIO3_3_HYSDISABLE

#define PIO3_3_CON         (FUNC_PIO3_3 | (PIO3_3_MODE << 3) | (PIO3_3_HYS << 5))
/*********************************************************************************************************
  P3_4口引脚功能配置
*********************************************************************************************************/
#define PIO3_4_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO3_4         PIO3_4_GPIO

#define PIO3_4_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO3_4_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO3_4_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO3_4_REPEATER     0x03                                        /*  中继模式                    */

#define PIO3_4_MODE         PIO3_4_PULLUP

#define PIO3_4_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO3_4_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO3_4_HYS          PIO3_4_HYSDISABLE

#define PIO3_4_CON         (FUNC_PIO3_4 | (PIO3_4_MODE << 3) | (PIO3_4_HYS << 5))
/*********************************************************************************************************
  P3_5口引脚功能配置
*********************************************************************************************************/
#define PIO3_5_GPIO         0x00                                        /*  GPIO                        */

#define FUNC_PIO3_5         PIO3_5_GPIO

#define PIO3_5_INACTIVE     0x00                                        /*  高阻（既不上拉也不下拉）    */
#define PIO3_5_PULLDOWN     0x01                                        /*  内部下拉                    */
#define PIO3_5_PULLUP       0x02                                        /*  内部上拉                    */
#define PIO3_5_REPEATER     0x03                                        /*  中继模式                    */

#define PIO3_5_MODE         PIO3_5_PULLUP

#define PIO3_5_HYSDISABLE   0                                           /*  滞后禁能                    */
#define PIO3_5_HYSENABLE    1                                           /*  滞后使能                    */

#define PIO3_5_HYS          PIO3_5_HYSDISABLE

#define PIO3_5_CON         (FUNC_PIO3_5 | (PIO3_5_MODE << 3) | (PIO3_5_HYS << 5))

/*********************************************************************************************************
** Function name:       pinInit
** Descriptions:        初始化所有的引脚配置，完成引脚连接、上下拉电阻设置
** Input parameters:    none
** Output parameters:   none
** Returned value:      none
*********************************************************************************************************/
extern void pinInit(void);

#endif                                                                  /*  __LPC1300PINCFG_H           */
/*********************************************************************************************************
  End Of File
*********************************************************************************************************/
